{
  "backend/main.mo": "Defines actor backend with user profiles, coins, balances, orders, and market cap trend storage plus coin creation and balance lookup helpers.",
  "feature_evidence.json": "Lists feature evidence mapping features to frontend files, components, and test IDs with confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of major frontend files including pages, hooks, components, and styling.",
  "frontend/index.css": "Defines global Tailwind-based theme variables and dark mode settings using OKLCH color tokens and terminal-style styling.",
  "frontend/index.html": "HTML entry point loading fonts, Stripe.js, metadata, favicon, and bootstrapping the React app.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, authenticated layout logic, and renders the router provider.",
  "frontend/src/components/auth/LoginButton.tsx": "Implements login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for creating user profiles with validation, error handling, and submission to backend.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout with header, navigation, user menu, and background wrapper.",
  "frontend/src/components/layout/CyberBackground.tsx": "Renders a fixed semi-transparent trading-style background image with gradient overlay.",
  "frontend/src/components/payments/StripeCardFields.tsx": "Stripe card input component handling cardholder name, card element mount, and error display.",
  "frontend/src/components/rank/RankBadge.tsx": "Displays user rank in compact, full, or card variants using tier metadata.",
  "frontend/src/components/trends/MarketCapSparkline.tsx": "Small SVG sparkline chart visualizing market cap trend direction.",
  "frontend/src/components/trends/MarketCapTrendDialog.tsx": "Dialog presenting detailed market cap trend chart and statistics with loading states.",
  "frontend/src/hooks/queries/useBalances.ts": "React Query hook fetching token balance from backend actor.",
  "frontend/src/hooks/queries/useCoinsDirectory.ts": "Builds and exposes a symbol-indexed map of creator coins with profiles; includes resolver hook.",
  "frontend/src/hooks/queries/useCreatorCap.ts": "Hooks for fetching creator cap rankings and the caller's creator cap.",
  "frontend/src/hooks/queries/useFiatRamps.ts": "Mutation hooks handling Stripe deposit and withdrawal session flows.",
  "frontend/src/hooks/queries/useLeaderboard.ts": "Fetches creator cap ranking and formats it into a leaderboard with ranks.",
  "frontend/src/hooks/queries/useMarketCapTrend.ts": "Provides a React Query hook to fetch a creator’s market cap trend from the backend when an actor and principal are available.",
  "frontend/src/hooks/queries/useOrderBook.ts": "Fetches an order book for a given symbol and side with periodic refetching and symbol normalization.",
  "frontend/src/hooks/queries/useOrders.ts": "Defines a mutation to place orders and invalidates related queries like order books and balances on success.",
  "frontend/src/hooks/queries/useStablecoinBalance.ts": "Retrieves the user’s USDC balance using the actor when available.",
  "frontend/src/hooks/queries/useUserProfile.ts": "Provides queries and mutations for fetching and modifying user profiles, including caller and public profiles.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login, logout, and identity loading through AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom design system with color variables and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/ActivityPage.tsx": "Renders the creator leaderboard page, loading profiles and market cap trends for each entry.",
  "frontend/src/pages/CoinDetailPage.tsx": "Displays detailed information for a specific coin, including profile data, order books, and buy/sell order placement. Handles loading, errors, and form interactions for submitting orders.",
  "frontend/src/pages/CoinsPage.tsx": "Shows a searchable directory of all coins and profiles, with navigation to individual coin detail pages. Handles loading, errors, and filtering by name, username, or symbol.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the user dashboard with rank status, progress toward next tier, and balances across assets. Fetches profile, balance, and creator cap data and displays summary cards.",
  "frontend/src/pages/DepositPage.tsx": "Provides a Stripe-powered deposit form allowing users to fund their account with USD to receive stablecoin. Shows current balance, calculates fees, and handles deposit submission state.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen that redirects logged‑in users to the dashboard and offers login/start actions. Includes hero content, platform branding, and a feature overview section.",
  "frontend/src/pages/WithdrawPage.tsx": "React page for withdrawing stablecoin to USD, showing balance, fee calculations, form fields, and success handling.",
  "frontend/src/utils/assetSymbols.ts": "Returns a per‑user asset symbol derived directly from the username.",
  "frontend/src/utils/currency.ts": "Utility functions for formatting USDC cents and market cap values for display.",
  "frontend/src/utils/rank.ts": "Defines rank tiers and helpers to determine a user’s tier and progress based on creator market cap.",
  "frontend/src/utils/stripe.ts": "Initializes and returns a global Stripe instance using a publishable key.",
  "frontend/src/utils/trendChart.ts": "Transforms market cap trend data and provides scaling, formatting, and SVG path generation utilities for charts.",
  "frontend/src/utils/urlParams.ts": "Parses URL parameters with session persistence and helpers for reading, storing, and clearing parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, fonts, animations, and extended theme settings.",
  "project_state.json": "Project metadata tracking schema, features, and pending requests for per‑user trend graph functionality."
}