{
  "backend/main.mo": "Motoko canister implementing user profiles, coin creation, balances, orders, and in‑memory Stripe session tracking with authorization mixin.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, and test IDs for recent UI and asset‑flow updates.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend pages, hooks, and components.",
  "frontend/index.css": "Tailwind base and theme variable definitions configuring light/dark trading‑style color tokens and global typography/background styling.",
  "frontend/index.html": "HTML entry point loading fonts, Stripe.js, favicon, and mounting the React app root.",
  "frontend/src/App.tsx": "Main React router configuration defining public and authenticated layouts with pages for dashboard, coins, activity, deposit, and withdraw.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache reset on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal form for creating a user profile with username, display name, bio, validation, and error handling.",
  "frontend/src/components/layout/AppShell.tsx": "Main application shell with header, navigation, user menu, and logout handling.",
  "frontend/src/components/layout/CyberBackground.tsx": "Renders a fixed trading-themed background image with gradient overlays.",
  "frontend/src/components/payments/StripeCardFields.tsx": "Stripe card input component that mounts a Stripe card element and handles cardholder name and card errors.",
  "frontend/src/components/rank/RankBadge.tsx": "Displays rank information in compact, full, or card formats using tier styling and icons.",
  "frontend/src/hooks/queries/useBalances.ts": "Fetches a user's token balance for a given symbol using the actor API.",
  "frontend/src/hooks/queries/useCoinsDirectory.ts": "Builds a symbol-to-coin directory from backend data and profiles; also provides lookup by symbol.",
  "frontend/src/hooks/queries/useCreatorCap.ts": "Queries creator market cap rankings and fetches the caller's specific creator cap value.",
  "frontend/src/hooks/queries/useFiatRamps.ts": "Provides mutations for creating deposits and withdrawals via Stripe-backed backend sessions.",
  "frontend/src/hooks/queries/useLeaderboard.ts": "Fetches creator cap rankings and maps them into a ranked leaderboard structure.",
  "frontend/src/hooks/queries/useOrderBook.ts": "Retrieves order book data for a given symbol and side with periodic refresh.",
  "frontend/src/hooks/queries/useOrders.ts": "Mutation hook to place an order via actor and invalidate related queries on success.",
  "frontend/src/hooks/queries/useStablecoinBalance.ts": "Query hook fetching the user's USDC balance from the actor when available.",
  "frontend/src/hooks/queries/useUserProfile.ts": "Hooks for fetching and mutating user profiles, including current, specific, and placeholder list queries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and state management.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme variables and utility classes with terminal-style aesthetics.",
  "frontend/src/main.tsx": "App entry initializing React, React Query, and the Internet Identity provider.",
  "frontend/src/pages/ActivityPage.tsx": "Leaderboard page displaying creator rankings with profile lookups and styled ranking rows.",
  "frontend/src/pages/CoinDetailPage.tsx": "Asset detail page fetching coin data, order books, and enabling buy/sell order placement.",
  "frontend/src/pages/CoinsPage.tsx": "Displays a searchable grid of coin profiles fetched from the coins directory and navigates to individual coin pages. Handles loading, error states, and search filtering.",
  "frontend/src/pages/DashboardPage.tsx": "Shows the user’s dashboard with profile info, balances, rank status, and progress toward the next rank. Includes loading states and multiple metric cards.",
  "frontend/src/pages/DepositPage.tsx": "Provides a form for depositing USD via Stripe to receive USDC, showing current balance, fees, and success feedback. Handles Stripe card input and deposit submission.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with login flow, hero section, and feature highlights, redirecting authenticated users to the dashboard. Includes animated visuals and navigation actions.",
  "frontend/src/pages/WithdrawPage.tsx": "Allows users to withdraw USDC to a bank account with fee calculation, balance display, and success messaging. Validates input and submits withdrawal requests.",
  "frontend/src/utils/assetSymbols.ts": "Returns a user's asset symbol directly from their username with no transformation.",
  "frontend/src/utils/currency.ts": "Utility functions for formatting USDC amounts, prices, and large market cap values into readable strings.",
  "frontend/src/utils/rank.ts": "Defines rank tiers based on creator market cap and provides helpers to get the current tier, next tier, and progress percentage.",
  "frontend/src/utils/stripe.ts": "Initializes and returns a Stripe instance from the global window object and defines a simple card element event type.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugin integrations for the app’s design system.",
  "project_state.json": "Describes the project’s build state, goals, requirements, issues, and design direction for the StonkSquad app."
}