{
  "backend/main.mo": "Defines the main actor with authorization mixin, persistent maps for users, coins, balances, orders, price history, and logic for creating coins and retrieving balances.",
  "backend/migration.mo": "Provides migration logic from the old actor state to a new state that adds price history, initializing it as an empty map.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose and behavior of multiple frontend files across the project.",
  "frontend/index.css": "Defines global Tailwind-based styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point configuring metadata, fonts, Stripe.js, and mounting the root app element.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, authentication layout, and routes for landing, dashboard, coins, coin detail, activity, deposit, and withdraw pages.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity with loading states and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for creating a user profile with username, display name, bio, validation, and error handling.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout with header, navigation, user menu, and logout handling wrapped over routed content.",
  "frontend/src/components/layout/CyberBackground.tsx": "Renders a fixed stylized background image with gradient overlay for the app.",
  "frontend/src/components/payments/StripeCardFields.tsx": "Stripe card input component initializing Stripe Elements and handling cardholder name and errors.",
  "frontend/src/components/rank/RankBadge.tsx": "Displays user rank in compact, full, or card variants using tier metadata and icons.",
  "frontend/src/components/trading/PriceHistoryChart.tsx": "Generates an SVG price history chart with trend indicators, loading states, and formatted price display.",
  "frontend/src/components/trends/MarketCapSparkline.tsx": "Renders a small sparkline SVG showing market cap trend with color based on direction.",
  "frontend/src/components/trends/MarketCapTrendDialog.tsx": "Dialog showing detailed market cap trend chart with stats, loading state, and SVG rendering.",
  "frontend/src/hooks/queries/useBalances.ts": "Provides a query hook to fetch a user's token balance for a given symbol using the actor.",
  "frontend/src/hooks/queries/useCoinsDirectory.ts": "Builds a directory of coins mapped by symbol and provides a resolver to fetch coin details by symbol.",
  "frontend/src/hooks/queries/useCreatorCap.ts": "Fetches creator market cap rankings and retrieves the caller’s own creator cap value.",
  "frontend/src/hooks/queries/useFiatRamps.ts": "Implements deposit and withdrawal mutations using Stripe sessions and refreshes balances on success.",
  "frontend/src/hooks/queries/useLeaderboard.ts": "Retrieves ranked creator market cap data and assigns rank numbers for display.",
  "frontend/src/hooks/queries/useMarketCapTrend.ts": "Fetches historical market cap trend points for a specific creator principal.",
  "frontend/src/hooks/queries/useOrderBook.ts": "Queries the order book for a given symbol and side with periodic refresh.",
  "frontend/src/hooks/queries/useOrders.ts": "Provides mutations for placing limit and market orders and invalidates related queries after execution.",
  "frontend/src/hooks/queries/usePriceHistory.ts": "Fetches price history for a symbol with optional point limits and periodic updates.",
  "frontend/src/hooks/queries/useStablecoinBalance.ts": "Queries the user's USDC balance using the actor.",
  "frontend/src/hooks/queries/useUserProfile.ts": "Handles fetching and updating user profiles, including caller and public profiles.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and identity persistence.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme OKLCH color variables plus custom terminal-style utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/ActivityPage.tsx": "Displays a creator leaderboard with rank tiers, profile data, market cap, and sparkline trends.",
  "frontend/src/pages/CoinDetailPage.tsx": "Shows detailed asset info including price history, order books, and market order placement UI.",
  "frontend/src/pages/CoinsPage.tsx": "Lists all coins with search and navigation, showing profile info and basic asset details.",
  "frontend/src/pages/DashboardPage.tsx": "Provides a user dashboard with profile info, rank status, progress toward next tier, and balance metrics.",
  "frontend/src/pages/DepositPage.tsx": "UI page for depositing USD via Stripe, showing balance, handling card input, fee calculations, and triggering deposit mutation.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen with marketing sections that redirects logged-in users and provides login/start actions.",
  "frontend/src/pages/WithdrawPage.tsx": "UI page for withdrawing USDC to a bank account, showing balance, validating inputs, calculating fees, and submitting withdrawal.",
  "frontend/src/utils/assetSymbols.ts": "Provides a simple utility to derive a user’s asset symbol directly from their username.",
  "frontend/src/utils/currency.ts": "Utility functions for formatting USDC values, market caps, and prices for display.",
  "frontend/src/utils/rank.ts": "Defines rank tiers and helpers to compute a user’s rank, next tier, and progress based on creator market cap.",
  "frontend/src/utils/stripe.ts": "Initializes and returns a global Stripe instance using the publishable key from environment variables.",
  "frontend/src/utils/trendChart.ts": "Utilities for normalizing market-cap trend data, scaling it to SVG coordinates, generating paths, and formatting axis labels and timestamps.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear them from the hash.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, fonts, container settings, and animations using multiple plugins.",
  "project_state.json": "Defines the project’s current state, including implemented features and pending feature requests for a trading app."
}