{
  "backend/main.mo": "Motoko canister managing user profiles, coin creation, balances, and orders with access control and helper functions for lookups and defaults.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all main frontend files.",
  "frontend/index.css": "Tailwind base styles defining color tokens, themes, and global background/foreground rules.",
  "frontend/index.html": "HTML entry point setting metadata, title, favicon, root div, and loading the main script.",
  "frontend/src/App.tsx": "React app routing setup with authenticated layout, profile-setup gating, and main page routes.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Profile creation modal with username, display name, bio input, name confirmation, and error handling.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing navigation, user info, and logout handling with responsive UI.",
  "frontend/src/hooks/queries/useBalances.ts": "React Query hook that fetches a user's token balance via the actor API.",
  "frontend/src/hooks/queries/useOrderBook.ts": "Fetches an order book for a symbol and side with periodic refetching.",
  "frontend/src/hooks/queries/useOrders.ts": "Provides a mutation for placing orders and invalidates balance and order book caches on success.",
  "frontend/src/hooks/queries/useUserProfile.ts": "Hooks for fetching and mutating the caller's user profile with cache invalidation.",
  "frontend/src/hooks/useActor.ts": "Manages creation and caching of the backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context handling login, logout, and stored identities.",
  "frontend/src/index.css": "Tailwind base setup defining light and dark theme variables and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/ActivityPage.tsx": "UI page showing placeholder leaderboards and recent activity tables.",
  "frontend/src/pages/CoinDetailPage.tsx": "Displays a coin's order book and lets users place buy or sell orders with live data loading states.",
  "frontend/src/pages/CoinsPage.tsx": "Shows a searchable list of user profiles and navigates to individual coin detail pages; currently uses placeholder data.",
  "frontend/src/pages/DashboardPage.tsx": "Loads and displays the logged-in user's profile, SQD balance, personal asset balance, and basic dashboard info.",
  "frontend/src/pages/LandingPage.tsx": "Public landing screen with login flow, redirecting authenticated users to the dashboard and showcasing features.",
  "frontend/src/utils/assetSymbols.ts": "Returns the asset symbol for a user, currently identical to their username.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Defines overall project state, existing features, and architectural notes for building the StonkSquad web app. Contains versioning, feature list, and guidance on UI language and asset usage."
}