{
  "kind": "build_request",
  "title": "Shift UI to trading/alpha theme and enforce $0 starting market cap for new assets",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-42",
      "text": "Update the app’s visual theme to a less cyberpunk, more trading/alpha aesthetic while maintaining all existing features and routes. This includes updating the global design tokens (colors, typography, radii, shadows/glows) so the UI reads as \"trading terminal / alpha\" rather than neon cyberpunk, and applying the updated look consistently across Landing, AppShell header/footer, Dashboard, People/Coins, Coin Detail, Activity/Leaderboard, Deposit, and Withdraw pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "change the theme, background and all, to less cyber punk and more trafing / alpha while maintaining all features."
        ]
      },
      "acceptanceCriteria": [
        "All existing pages/routes still render and function (auth gating, navigation, trading/order placement, Stripe deposit/withdraw flows, leaderboard).",
        "Global theme variables in frontend/src/index.css are updated away from neon/cyberpunk styling to a trading/alpha palette and typography, and the new tokens are used by existing shadcn/Tailwind classes.",
        "Cyberpunk-specific utility styling (e.g., heavy neon glows/borders) is either toned down or replaced with trading/terminal-like treatments while keeping layout and component structure intact."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Replace the current cyberpunk background treatment with a new trading/alpha background treatment across both public and authenticated layouts. Update the shared background component (currently frontend/src/components/layout/CyberBackground.tsx) and its usages (e.g., LandingPage and AppShell) so the new background is used everywhere, including appropriate opacity/gradient overlays to preserve readability.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "change the theme, background and all, to less cyber punk and more trafing / alpha"
        ]
      },
      "acceptanceCriteria": [
        "Landing page and authenticated AppShell both use the updated background component and no longer reference a cyberpunk-only background treatment.",
        "Background remains fixed/fullscreen with layered overlay so text contrast remains strong on all pages.",
        "No regressions in scroll behavior, z-index layering, or clickability of UI due to the background layer."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Ensure fair-launch behavior by making market cap start at exactly 0 for every newly created asset until there is real market activity establishing a price. Update backend market-cap/price logic so that assets with no valid price-discovery data have current price = 0 and therefore market cap = 0 (rather than a non-zero default).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make sure marketcap starts at 0"
        ]
      },
      "acceptanceCriteria": [
        "For any coin with no qualifying price-discovery data, backend market-cap calculations return 0 for that coin and 0 for its creator’s aggregated market cap.",
        "Creating a user profile/coin does not implicitly set a non-zero price or non-zero market cap.",
        "Creator leaderboard entries for creators whose coins have no price-discovery data show creatorMarketCap = 0."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Fix backend creator market-cap aggregation correctness so that per-creator totals reflect the sum of each created coin’s market cap (current price * totalSupply), and ensure the creator ranking query iterates over the actual creator set (users) rather than relying on unrelated balance maps. Keep the leaderboard metric as creator market cap.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make sure marketcap starts at 0 and all coins work correct"
        ]
      },
      "acceptanceCriteria": [
        "getCreatorCapRanking returns a sorted list (high to low) based on correct creator market cap totals computed from the creator’s launched coins.",
        "getCreatorCoinsWithMarketCaps returns totals that equal the sum across the returned coin list of (current price * totalSupply) in consistent units.",
        "Creators that exist in users are included in ranking even if they have no SQD/other legacy balance entries, and creators with zero market cap rank appropriately (including showing 0)."
      ]
    },
    {
      "id": "REQ-46",
      "text": "Audit and fix coin/asset flows so that \"all coins work correct\" end-to-end: coin discovery/listing, symbol resolution, coin detail loading, order book loading, and order placement should behave correctly for any valid symbol, including newly created users/assets. Add or improve frontend empty/error states where backend returns null/missing data, without changing user-facing text away from English.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "all coins work correct"
        ]
      },
      "acceptanceCriteria": [
        "Coins/People page navigation consistently routes to the correct Coin Detail page for a selected user/asset symbol.",
        "Coin Detail page shows a clear English empty state when there are no orders yet, and does not imply a non-zero market cap/price when there is no price-discovery data.",
        "Placing buy/sell orders continues to work with existing validations; failures surface as non-crashing UI error states rather than silent failure.",
        "Activity/Leaderboard renders 0 market cap correctly for creators with no price-discovery data (no NaN, no negative values, no unexpected default)."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture: all Motoko logic changes must be implemented in backend/main.mo.",
    "Do not modify files under frontend/src/components/ui (read-only shadcn sources); compose them instead.",
    "Do not modify frontend immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not remove or redesign existing product features (Internet Identity auth, profiles, order book, trading ticket, leaderboard, deposit/withdraw/Stripe flows).",
    "Do not add new third-party auth providers or new backend services/databases.",
    "Do not change the ranking metric away from creator market cap."
  ],
  "imageRequirements": {
    "required": [
      "Fullscreen trading/alpha background image with subtle finance/terminal vibe, dark neutral palette, minimal neon (alpha-bg.dim_1920x1080.png)"
    ],
    "edits": []
  }
}