{
  "kind": "build_request",
  "title": "Add per-user trend graph (public) for creator market cap over time",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend API that returns a public per-user time-series suitable for graphing a trend over time, so any viewer can request the trend for any specified user principal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "can you make a graph for every user so people can see trend"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a new public query method that accepts a target user Principal and returns an ordered list of (timestamp, value) points.",
        "The method is callable by any caller (including non-admins) without trapping for authorization reasons.",
        "Returned series is sorted by timestamp ascending and capped/limited to prevent unbounded responses (e.g., optional limit parameter or a fixed maximum)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Track and store creator market cap trend points per user over time, updating the time-series whenever an event occurs that can change creator market cap (at minimum: when any order is placed).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "can you make a graph for every user so people can see trend"
        ]
      },
      "acceptanceCriteria": [
        "When an order is placed, the backend appends a new trend point for the relevant creator(s) so the trend series changes over time.",
        "New users start with an initial trend point representing a fair-launch starting value (0) at profile creation time.",
        "The trend tracking does not break existing order placement behavior and does not change existing return types for current APIs."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a public backend API to fetch a user's public profile data for display in public contexts (e.g., leaderboard rows), without requiring caller==user or admin permissions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "can you make a graph for every user so people can see trend"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a new public query method that returns a user’s public profile data by Principal (or returns null if missing).",
        "The new public profile query is callable by any caller without trapping for authorization.",
        "Existing restricted profile method(s) remain unchanged (no widening of access on the existing protected method)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement a frontend trend graph UI for each user so people can view trend history from the leaderboard (Activity page).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "can you make a graph for every user so people can see trend"
        ]
      },
      "acceptanceCriteria": [
        "Activity page displays an inline mini trend visualization (sparkline) or a clear ‘View trend’ action per leaderboard row.",
        "Clicking/tapping a user’s trend opens a detailed view (e.g., dialog/drawer/section) that renders the full time-series graph with labeled axes/values (English labels).",
        "The graph renders correctly for empty/short series (0–1 point) with a clear English empty-state message.",
        "UI uses existing Tailwind/Shadcn components (composed, not modifying immutable UI source files)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add React Query hooks to fetch per-user trend series and public profile data, and update the leaderboard row implementation to use the new public profile API (avoiding unauthorized traps).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "can you make a graph for every user so people can see trend"
        ]
      },
      "acceptanceCriteria": [
        "A new query hook fetches a user’s trend series from the backend and is used by the Activity leaderboard row/chart UI.",
        "The leaderboard’s profile lookup no longer calls the restricted getUserProfile method; it uses the new public profile query.",
        "All new queries include loading and error states consistent with existing patterns (e.g., Skeletons and simple English error text)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Do not add real-time updates (no websockets/streaming).",
    "Do not add third-party charting libraries unless already present; prefer a lightweight in-app SVG/canvas chart component.",
    "Do not change the leaderboard ranking metric (it remains based on creator market cap).",
    "Do not implement external analytics or external database storage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}