{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Per-user market cap trend graph UI on Activity leaderboard",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Add per-user trend visualization on the Activity leaderboard with a detailed graph view and robust empty/loading states using existing Tailwind/shadcn components.",
      "acceptanceCriteria": [
        "Activity page displays an inline mini trend visualization (sparkline) or a clear ‘View trend’ action per leaderboard row.",
        "Clicking/tapping a user’s trend opens a detailed view (e.g., dialog/drawer/section) that renders the full time-series graph with labeled axes/values (English labels).",
        "The graph renders correctly for empty/short series (0–1 point) with a clear English empty-state message.",
        "UI uses existing Tailwind/Shadcn components (composed, not modifying immutable UI source files)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/trends/MarketCapSparkline.tsx",
          "operation": "create",
          "description": "Create a lightweight in-app SVG sparkline component for market cap trend mini-visualizations (no third-party chart libs). Accepts a time-series and renders a compact line with sensible handling for 0–1 points. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/trends/MarketCapTrendDialog.tsx",
          "operation": "create",
          "description": "Create a detailed trend view component that composes existing shadcn-ui primitives (e.g., Dialog/Drawer, Card, Skeleton, Button) to show a larger SVG line chart with English axis/value labels, and an English empty-state message for 0–1 points. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/trendChart.ts",
          "operation": "create",
          "description": "Add shared chart utilities for scaling timestamps/values to SVG coordinates, formatting axis labels, and normalizing short/empty series for consistent rendering in sparkline and detailed chart."
        },
        {
          "path": "frontend/src/pages/ActivityPage.tsx",
          "operation": "modify",
          "description": "Update the leaderboard row UI to include either an inline MarketCapSparkline or a clear 'View trend' action per row, and wire a click/tap to open MarketCapTrendDialog for that row. Include loading Skeletons and simple English error/empty text for trend data, and ensure rendering remains stable for empty/short series. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add React Query hooks for per-user trend series and public profile lookup, and update Activity leaderboard rows to use public profile data to avoid unauthorized traps.",
      "acceptanceCriteria": [
        "A new query hook fetches a user’s trend series from the backend and is used by the Activity leaderboard row/chart UI.",
        "The leaderboard’s profile lookup no longer calls the restricted getUserProfile method; it uses the new public profile query.",
        "All new queries include loading and error states consistent with existing patterns (e.g., Skeletons and simple English error text)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/queries/useMarketCapTrend.ts",
          "operation": "create",
          "description": "Add a React Query hook to fetch a user's market cap trend series via the backend actor (getMarketCapTrend) keyed by principal, with enabled gating on actor readiness and simple retry behavior consistent with existing hooks."
        },
        {
          "path": "frontend/src/hooks/queries/useUserProfile.ts",
          "operation": "modify",
          "description": "Update the per-user profile query hook to use the new public profile backend capability (getPublicUserProfile) instead of the restricted method, and add/adjust loading/error behavior consistent with existing patterns. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ActivityPage.tsx",
          "operation": "modify",
          "description": "Wire Activity leaderboard rows to use the updated public profile hook and the new useMarketCapTrend hook, showing Skeletons while loading and simple English error text when a query fails, without breaking existing leaderboard rendering."
        }
      ]
    }
  ]
}