{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Trade screen chart embed + market-only one-click trading UI",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Embed a per-asset price chart on the coin trade screen, driven by recent on-chain price history and auto-updating on an interval.",
      "acceptanceCriteria": [
        "On the asset trade screen (frontend/src/pages/CoinDetailPage.tsx), a visible chart is rendered for the selected symbol.",
        "The chart displays recent historical price points for that symbol and updates automatically on an interval (near-real-time).",
        "If there is insufficient data to chart (e.g., no orders), show a clear English empty-state message instead of crashing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/queries/usePriceHistory.ts",
          "operation": "create",
          "description": "Create a React Query hook that fetches recent price history for a symbol via the existing backend capability (getPriceHistory) and refetches on an interval for near-real-time updates. Handle missing/invalid symbols safely and return empty data without crashing."
        },
        {
          "path": "frontend/src/components/trading/PriceHistoryChart.tsx",
          "operation": "create",
          "description": "Create a lightweight SVG line-chart component for PricePoint[] rendering (time-ordered), including an English empty-state for insufficient data and basic loading handling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/CoinDetailPage.tsx",
          "operation": "modify",
          "description": "Wire the new price history hook and PriceHistoryChart into the trade screen so the currently selected symbol shows an embedded chart (not a dialog). Ensure the chart refreshes on an interval and displays an English empty-state when no/insufficient data is returned. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Replace limit-order UI with market-only flow: amount-to-spend input, live execution preview, and Buy Market / Sell Market buttons using the market-order backend capability.",
      "acceptanceCriteria": [
        "frontend/src/pages/CoinDetailPage.tsx no longer shows price and quantity inputs for placing orders.",
        "The trade form for Buy and Sell each includes: (1) a single numeric input for amount (USD/stablecoin), (2) a live preview of the estimated execution, and (3) one prominent button labeled exactly \"Buy Market\" or \"Sell Market\" (English).",
        "The preview clearly states the estimated quantity and the market price used for the estimate (English user-facing copy).",
        "Buttons are disabled and an English validation message is shown when the amount is missing/invalid or when a market price cannot be determined."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/queries/useOrders.ts",
          "operation": "modify",
          "description": "Add a new React Query mutation (e.g., usePlaceMarketOrder) that calls the existing backend capability for market orders (placeMarketOrder) using symbol + side + amountToSpend, and invalidates order book, balances, and related queries on success (similar to the existing limit-order mutation)."
        },
        {
          "path": "frontend/src/pages/CoinDetailPage.tsx",
          "operation": "modify",
          "description": "Remove limit-order price/quantity inputs and replace with market-only widgets: one amount-to-spend input (USDC), an English execution preview (estimated quantity + market price used), and one prominent button per side labeled exactly \"Buy Market\" / \"Sell Market\". Derive the market price for preview from the current order book (best opposite-side price); when unavailable, disable actions and show an English validation message. Ensure the new buttons call the market-order mutation (not the old limit-order path)."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Update trade screen layout/styling to cohesively integrate the embedded chart and simplified market-order widgets in the existing terminal/cyber theme with English labels.",
      "acceptanceCriteria": [
        "The chart is visually integrated on the trade screen (not hidden behind a dialog) and does not interfere with core trade actions.",
        "The simplified buy/sell UI is clearly scannable and reduces visual complexity compared to the prior limit-order form.",
        "All user-facing text introduced/changed by this request is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CoinDetailPage.tsx",
          "operation": "modify",
          "description": "Refactor the trade screen layout to place the embedded chart and order book alongside the simplified market-order forms in a clear, responsive grid. Use existing Tailwind/terminal classes for consistent cyber styling, ensure hierarchy/scannability (chart + key stats, then action panels), and keep all new UI copy in English. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}